var POIs = {

    cameras: [
        {


            lon: 121.393600,      // Decimal Degrees 
            lat: 31.082142,     // Decimal Degrees
            height: 0.0, // m
            pitch: 2,
            yaw: 2,
            type: 'm',  //球机
            pos: {
                x: 0,
                y: 0,
                z: 0
            },
        },
    ],

    tags: [
        {
            lon: 121.400411,
            lat: 31.084773,
            height: 0,
            text: 'this is B',
            pos: {
                x: 0,
                y: 0,
                z: 0
            }
        },
        {
            lon: 121.394542,
            lat: 31.082164,
            height: 0,
            text: 'this is B',
            pos: {
                x: 0,
                y: 0,
                z: 0
            }
        },
        {
            lon: 121.392254,
            lat: 31.081593,
            height: 0,
            text: 'this is B',
            pos: {
                x: 0,
                y: 0,
                z: 0
            }
        },
    ],
}

//31.0866745059,121.3892895058  //公司小阳台
// 31.0874625059, 121.3898965058 //公司停车场
// 31.0859625059, 121.3897395058 // 公司楼下
// 31.0770102657, 121.3803278522



//31.082142, 121.393600
//31.084773, 121.400411
// 31.082164, 121.394542
//31.081593, 121.392254