var POIs = {

    cameras: [
        {


            lon: 121.3890916802,      // Decimal Degrees 
            lat: 31.0867853451,     // Decimal Degrees
            height: 10.0, // m
            pitch: 2,
            yaw: 2,
            type: 'm',  //球机
            pos: {
                x: 0,
                y: 0,
                z: 0
            },
            north: {
                lon: 111,
                lat: 111,
            }
        },
    ],

    tags: [
        {
            lon: 121.3890755870,
            lat: 31.0871253015,
            height: 0,
            text: 'this is n',
            pos: {
                x: 0,
                y: 0,
                z: 0
            }
        },
      

        {
            lon: 121.3894242741,
            lat: 31.0874744447,
            height: 0,
            text: '署欧洗车',
            pos: {
                x: 0,
                y: 0,
                z: 0
            }
        },

        {
            lon: 121.3902503945,
            lat: 31.0893947090,
            height: 0,
            text: '银都路地铁站',
            pos: {
                x: 0,
                y: 0,
                z: 0
            }
        },

        {
            lon: 121.3902289368,
            lat: 31.0870563915,
            height: 0,
            text: '斗米乐',
            pos: {
                x: 0,
                y: 0,
                z: 0
            }
        },

        {
            lon: 121.3895691134,
            lat: 31.0856643992,
            height: 0,
            text: '上海拓建生物科技有限公司',
            pos: {
                x: 0,
                y: 0,
                z: 0
            }
        },

    ],
}






31.0867853451, 121.3890916802
31.0871253015, 121.3890755870



31.0874744447, 121.3894242741 // 署欧洗车
31.0893947090, 121.3902503945 // 银都路地铁站
31.0870563915, 121.3902289368 // 斗米乐
31.0856643992, 121.3895691134 // 上海拓建生物科技有限公司

